vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/Generated_Source/PSoC6/ADC_INVERTING_AMP.h
#define ADC_INVERTING_AMP_CFG0_SAMPLE_RATE             (500)
#define ADC_INVERTING_AMP_CFG0_CHANNEL_BASE            (0u)
#define ADC_INVERTING_AMP_CFG0_CHANNEL_COUNT           (1u)
#define ADC_INVERTING_AMP_CFG0_VREF_SEL_MASK           (0x70u)
#define ADC_INVERTING_AMP_CFG0_NOMINAL_CLOCK_FREQ      (1724137u)
#define ADC_INVERTING_AMP_CFG0_CHANNEL_EN              (0x1u)

/* Sample Control Register */
#define ADC_INVERTING_AMP_CFG0_SINGLE_ENDED_FORMAT     (0uL)
#define ADC_INVERTING_AMP_CFG0_DIFFERENTIAL_FORMAT     (0uL)
#define ADC_INVERTING_AMP_CFG0_SAMPLES_AVERAGED        (7uL)
#define ADC_INVERTING_AMP_CFG0_RANGE_INTR_MASK         (0x0u)
#define ADC_INVERTING_AMP_CFG0_SATURATE_INTR_MASK      (0x0u)
#define ADC_INVERTING_AMP_CFG0_VNEG_INPUT_SEL          (7)
#define ADC_INVERTING_AMP_CFG0_SINGLE_PRESENT          (1)
#define ADC_INVERTING_AMP_CFG0_VREF_MV_VALUE           (3300)
#define ADC_INVERTING_AMP_CFG0_APERTURE_TIME0          (1023uL)
#define ADC_INVERTING_AMP_CFG0_APERTURE_TIME1          (2uL)
#define ADC_INVERTING_AMP_CFG0_APERTURE_TIME2          (2uL)
#define ADC_INVERTING_AMP_CFG0_APERTURE_TIME3          (2uL)
#define ADC_INVERTING_AMP_CFG0_FREERUNNING             (1u)
#define ADC_INVERTING_AMP_CFG0_AVGERAGING_MODE         (1uL)
#define ADC_INVERTING_AMP_CFG0_LOW_LIMIT               (512u)
#define ADC_INVERTING_AMP_CFG0_HIGH_LIMIT              (3584u)
#define ADC_INVERTING_AMP_CFG0_RANGE_COND              (1uL)
#define ADC_INVERTING_AMP_CFG0_USE_SOC                 (0uL)
#define ADC_INVERTING_AMP_CFG0_VREF_PWR                (6uL)
#define ADC_INVERTING_AMP_CFG0_COMP_PWR                (6uL)
#define ADC_INVERTING_AMP_CFG0_COMP_DLY                (3uL)

/* Clock parameters*/
#if (ADC_INVERTING_AMP_CLOCK_INTERNAL)
    #define ADC_INVERTING_AMP_CFG0_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_INVERTING_AMP_CFG0_NOMINAL_CLOCK_FREQ)) - 1u)
#endif /* (ADC_INVERTING_AMP_CLOCK_INTERNAL) */

/* ************************************************************************** */
/* End configuration 0 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 1 customizer defines                                   */
/* ************************************************************************** */

#if(ADC_INVERTING_AMP_TOTAL_CONFIGS > 1)
    #define ADC_INVERTING_AMP_CFG1_SAMPLE_RATE             ()
    #define ADC_INVERTING_AMP_CFG1_CHANNEL_BASE            (u)
    #define ADC_INVERTING_AMP_CFG1_CHANNEL_COUNT           (u)
    #define ADC_INVERTING_AMP_CFG1_VREF_SEL_MASK           (u)
    #define ADC_INVERTING_AMP_CFG1_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_INVERTING_AMP_CFG1_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define ADC_INVERTING_AMP_CFG1_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_INVERTING_AMP_CFG1_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_INVERTING_AMP_CFG1_SAMPLES_AVERAGED        (uL)
    #define ADC_INVERTING_AMP_CFG1_RANGE_INTR_MASK         (u)
    #define ADC_INVERTING_AMP_CFG1_SATURATE_INTR_MASK      (u)
    #define ADC_INVERTING_AMP_CFG1_VNEG_INPUT_SEL          ()
    #define ADC_INVERTING_AMP_CFG1_SINGLE_PRESENT          ()
    #define ADC_INVERTING_AMP_CFG1_VREF_MV_VALUE           ()
    #define ADC_INVERTING_AMP_CFG1_APERTURE_TIME0          (uL)
    #define ADC_INVERTING_AMP_CFG1_APERTURE_TIME1          (uL)
    #define ADC_INVERTING_AMP_CFG1_APERTURE_TIME2          (uL)
    #define ADC_INVERTING_AMP_CFG1_APERTURE_TIME3          (uL)
    #define ADC_INVERTING_AMP_CFG1_FREERUNNING             (u)
    #define ADC_INVERTING_AMP_CFG1_AVGERAGING_MODE         (uL)
    #define ADC_INVERTING_AMP_CFG1_LOW_LIMIT               (u)
    #define ADC_INVERTING_AMP_CFG1_HIGH_LIMIT              (u)
    #define ADC_INVERTING_AMP_CFG1_RANGE_COND              (uL)
    #define ADC_INVERTING_AMP_CFG1_USE_SOC                 (0uL)
    #define ADC_INVERTING_AMP_CFG1_VREF_PWR                (uL)
    #define ADC_INVERTING_AMP_CFG1_COMP_PWR                (uL)
    #define ADC_INVERTING_AMP_CFG1_COMP_DLY                (uL)

    /* Clock parameters*/
    #if (ADC_INVERTING_AMP_CLOCK_INTERNAL)
        #define ADC_INVERTING_AMP_CFG1_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_INVERTING_AMP_CFG1_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_INVERTING_AMP_CLOCK_INTERNAL) */
#endif /* #if(ADC_INVERTING_AMP_TOTAL_CONFIGS > 1) */

/* ************************************************************************** */
/* End configuration 1 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 2 customizer defines                                         */
/* ************************************************************************** */

#if(ADC_INVERTING_AMP_TOTAL_CONFIGS > 2)
    #define ADC_INVERTING_AMP_CFG2_SAMPLE_RATE             ()
    #define ADC_INVERTING_AMP_CFG2_CHANNEL_BASE            (u)
    #define ADC_INVERTING_AMP_CFG2_CHANNEL_COUNT           (u)
    #define ADC_INVERTING_AMP_CFG2_VREF_SEL_MASK           (u)
    #define ADC_INVERTING_AMP_CFG2_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_INVERTING_AMP_CFG2_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define ADC_INVERTING_AMP_CFG2_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_INVERTING_AMP_CFG2_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_INVERTING_AMP_CFG2_SAMPLES_AVERAGED        (uL)
    #define ADC_INVERTING_AMP_CFG2_RANGE_INTR_MASK         (u)
    #define ADC_INVERTING_AMP_CFG2_SATURATE_INTR_MASK      (u)
    #define ADC_INVERTING_AMP_CFG2_VNEG_INPUT_SEL          ()
    #define ADC_INVERTING_AMP_CFG2_SINGLE_PRESENT          ()
    #define ADC_INVERTING_AMP_CFG2_VREF_MV_VALUE           ()
    #define ADC_INVERTING_AMP_CFG2_APERTURE_TIME0          (uL)
    #define ADC_INVERTING_AMP_CFG2_APERTURE_TIME1          (uL)
    #define ADC_INVERTING_AMP_CFG2_APERTURE_TIME2          (uL)
    #define ADC_INVERTING_AMP_CFG2_APERTURE_TIME3          (uL)
    #define ADC_INVERTING_AMP_CFG2_FREERUNNING             (u)
    #define ADC_INVERTING_AMP_CFG2_AVGERAGING_MODE         (uL)
    #define ADC_INVERTING_AMP_CFG2_LOW_LIMIT               (u)
    #define ADC_INVERTING_AMP_CFG2_HIGH_LIMIT              (u)
    #define ADC_INVERTING_AMP_CFG2_RANGE_COND              (uL)
    #define ADC_INVERTING_AMP_CFG2_USE_SOC                 (0uL)
    #define ADC_INVERTING_AMP_CFG2_VREF_PWR                (uL)
    #define ADC_INVERTING_AMP_CFG2_COMP_PWR                (uL)
    #define ADC_INVERTING_AMP_CFG2_COMP_DLY                (uL)

