vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/Generated_Source/PSoC6/ADC_INVERTING_AMP.h
    /* Clock parameters*/
    #if (ADC_INVERTING_AMP_CLOCK_INTERNAL)
        #define ADC_INVERTING_AMP_CFG2_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_INVERTING_AMP_CFG2_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_INVERTING_AMP_CLOCK_INTERNAL) */
#endif /* (ADC_INVERTING_AMP_TOTAL_CONFIGS > 2) */


/* ************************************************************************** */
/* End configuration 2 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 3 customizer defines                                   */
/* ************************************************************************** */
#if(ADC_INVERTING_AMP_TOTAL_CONFIGS > 3)
    #define ADC_INVERTING_AMP_CFG3_SAMPLE_RATE             ()
    #define ADC_INVERTING_AMP_CFG3_CHANNEL_BASE            (u)
    #define ADC_INVERTING_AMP_CFG3_CHANNEL_COUNT           (u)
    #define ADC_INVERTING_AMP_CFG3_VREF_SEL_MASK           (u)
    #define ADC_INVERTING_AMP_CFG3_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_INVERTING_AMP_CFG3_CHANNEL_EN              (u)

    /* Sample Control Register */
    #define ADC_INVERTING_AMP_CFG3_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_INVERTING_AMP_CFG3_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_INVERTING_AMP_CFG3_SAMPLES_AVERAGED        (uL)
    #define ADC_INVERTING_AMP_CFG3_RANGE_INTR_MASK         (u)
    #define ADC_INVERTING_AMP_CFG3_SATURATE_INTR_MASK      (u)
    #define ADC_INVERTING_AMP_CFG3_VNEG_INPUT_SEL          ()
    #define ADC_INVERTING_AMP_CFG3_SINGLE_PRESENT          ()
    #define ADC_INVERTING_AMP_CFG3_VREF_MV_VALUE           ()
    #define ADC_INVERTING_AMP_CFG3_APERTURE_TIME0          (uL)
    #define ADC_INVERTING_AMP_CFG3_APERTURE_TIME1          (uL)
    #define ADC_INVERTING_AMP_CFG3_APERTURE_TIME2          (uL)
    #define ADC_INVERTING_AMP_CFG3_APERTURE_TIME3          (uL)
    #define ADC_INVERTING_AMP_CFG3_FREERUNNING             (u)
    #define ADC_INVERTING_AMP_CFG3_AVGERAGING_MODE         (uL)
    #define ADC_INVERTING_AMP_CFG3_LOW_LIMIT               (u)
    #define ADC_INVERTING_AMP_CFG3_HIGH_LIMIT              (u)
    #define ADC_INVERTING_AMP_CFG3_RANGE_COND              (uL)
    #define ADC_INVERTING_AMP_CFG3_USE_SOC                 (0uL)
    #define ADC_INVERTING_AMP_CFG3_VREF_PWR                (uL)
    #define ADC_INVERTING_AMP_CFG3_COMP_PWR                (uL)
    #define ADC_INVERTING_AMP_CFG3_COMP_DLY                (uL)

    /* Clock parameters*/
    #if (ADC_INVERTING_AMP_CLOCK_INTERNAL)
        #define ADC_INVERTING_AMP_CFG3_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_INVERTING_AMP_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_INVERTING_AMP_CLOCK_INTERNAL) */
#endif /* (ADC_INVERTING_AMP_TOTAL_CONFIGS > 3) */

/* ************************************************************************** */
/* End configuration 3 customizer defines                                     */
/* ************************************************************************** */

#define ADC_INVERTING_AMP_DEFAULT_SAMPLE_MODE_SEL      (0u)
#define ADC_INVERTING_AMP_FREERUNNING                  (1u)
#define ADC_INVERTING_AMP_HARDWARESOC                  (1u)
#define ADC_INVERTING_AMP_NEG_SEL_VSSA_KELVIN          (0x0uL)
#define ADC_INVERTING_AMP_NEG_SEL_VREF                 (0x7uL)
#define ADC_INVERTING_AMP_PWR_CTRL_VREF_NORMAL_PWR     (0x0uL)

/** ADC_INVERTING_AMP_TOTAL_CHANNELS_NUM
* This constant represents the number of input channels available for scanning.
*/
#define ADC_INVERTING_AMP_TOTAL_CHANNELS_NUM           (1u)

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** ADC_INVERTING_AMP_initVar
* The ADC_INVERTING_AMP_initVar variable is used to indicate
* initial configuration of this component. The variable is initialized to zero and
* set to 1 the first time ADC_INVERTING_AMP_Start() is called. This allows for
* component initialization without reinitialization in all subsequent calls to the
* ADC_INVERTING_AMP_Start() routine.
*
* If reinitialization of the component is required, then the ADC_INVERTING_AMP_Init() function
* can be called before the ADC_INVERTING_AMP_Start() or ADC_INVERTING_AMP_Enable()
* functions.
*/
extern uint8_t ADC_INVERTING_AMP_initVar;
extern uint8_t ADC_INVERTING_AMP_selected;
extern uint32_t ADC_INVERTING_AMP_currentConfig;

#define ADC_INVERTING_AMP_INIT_VAR_INIT_FLAG     (0x01u)

extern const ADC_INVERTING_AMP_CONFIG_STRUCT ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_TOTAL_CONFIGS];

/* SysPm callback structure for deep sleep entry and exit.
 * Call the Cy_SysPm_RegisterCallback function with this
 * structure before calling Cy_SysPm_DeepSleep.
*/
extern cy_stc_syspm_callback_t ADC_INVERTING_AMP_DeepSleepCallbackStruct;

/** @} globals */

/* ************************************************************************** */
/* *******************Global MUX_SWITCH0 Definitions ************************ */
/* ************************************************************************** */
#if(ADC_INVERTING_AMP_CFG0_VNEG_INPUT_SEL == ADC_INVERTING_AMP_NEG_SEL_VSSA_KELVIN)
    /* Do not connect VSSA to VMINUS when one channel in differential mode used */
    #if((ADC_INVERTING_AMP_TOTAL_CHANNELS_NUM == 1u) && (ADC_INVERTING_AMP_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_INVERTING_AMP_MUX_SWITCH0_INIT      0u
    #else    /* multiple channels or one single ended channel */
        #define ADC_INVERTING_AMP_MUX_SWITCH0_INIT      1u
    #endif /* ((ADC_INVERTING_AMP_TOTAL_CHANNELS_NUM == 1u) && (ADC_INVERTING_AMP_CFG0_SINGLE_PRESENT == 0u)) */
#else
    #define ADC_INVERTING_AMP_MUX_SWITCH0_INIT          0u
#endif /* ADC_INVERTING_AMP_CFG0_VNEG_INPUT_SEL == ADC_INVERTING_AMP_NEG_SEL_VSSA_KELVIN */

/* ************************************************************************** */
/* Begin configuration 0 calculated defines                                   */
/* ************************************************************************** */
#define ADC_INVERTING_AMP_CFG0_SAMPLE_TIME01_INIT \
        ((ADC_INVERTING_AMP_CFG0_APERTURE_TIME0 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
        | (ADC_INVERTING_AMP_CFG0_APERTURE_TIME1 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

