vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/Generated_Source/PSoC6/ADC_INVERTING_AMP.h
    #define ADC_INVERTING_AMP_CFG3_SAMPLE_TIME23_INIT \
            ((ADC_INVERTING_AMP_CFG3_APERTURE_TIME2 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
            | (ADC_INVERTING_AMP_CFG3_APERTURE_TIME3 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

    /* Enable soc pin if used */
    #define ADC_INVERTING_AMP_CFG3_DSI_TRIGGER_EN_INIT \
            (ADC_INVERTING_AMP_CFG3_USE_SOC \
             << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

    /* Set soc operation to edge or level based on sample mode */
    #if(ADC_INVERTING_AMP_CFG3_FREERUNNING == ADC_INVERTING_AMP_FREERUNNING)
        #define ADC_INVERTING_AMP_CFG3_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
    #else /* Edge trigger */
        #define ADC_INVERTING_AMP_CFG3_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End ADC_INVERTING_AMP_CFG3_FREERUNNING == ADC_INVERTING_AMP_FREERUNNING */

    /* Set SE_NEG_INPUT  */
    #if(ADC_INVERTING_AMP_CFG3_VNEG_INPUT_SEL == ADC_INVERTING_AMP_NEG_SEL_VSSA_KELVIN)
        #define ADC_INVERTING_AMP_CFG3_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_INVERTING_AMP_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
    #elif(ADC_INVERTING_AMP_CFG3_VNEG_INPUT_SEL == ADC_INVERTING_AMP_NEG_SEL_VREF)
        #define ADC_INVERTING_AMP_CFG3_SE_NEG_INPUT_INIT     (ADC_INVERTING_AMP_NEG_SEL_VREF \
                                                                << SAR_CTRL_NEG_SEL_Pos )
    #elif (ADC_INVERTING_AMP_CFG3_SINGLE_PRESENT != 0u)
        #define ADC_INVERTING_AMP_CFG3_SE_NEG_INPUT_INIT         ADC_INVERTING_AMP_CFG3_NEG_OTHER
    #else
        #define ADC_INVERTING_AMP_CFG3_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_INVERTING_AMP_CFG3_VNEG_INPUT_SEL == ADC_INVERTING_AMP_NEG_SEL_VSSA_KELVIN */

    #define ADC_INVERTING_AMP_CFG3_NEG_OTHER                 (uint16)((uint16)ADC_INVERTING_AMP_SARMUX__VNEG3 << SAR_CTRL_NEG_SEL_Pos)

    #define ADC_INVERTING_AMP_CFG3_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define ADC_INVERTING_AMP_CFG3_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk

    #define ADC_INVERTING_AMP_CFG3_POWER_INIT  (ADC_INVERTING_AMP_PWR_CTRL_VREF_NORMAL_PWR)

    /* SAMPLE_CTRL initial values */
    #define ADC_INVERTING_AMP_CFG3_SE_RESULT_FORMAT_INIT \
            (ADC_INVERTING_AMP_CFG3_SINGLE_ENDED_FORMAT \
            << SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos)

    #define ADC_INVERTING_AMP_CFG3_DIFF_RESULT_FORMAT_INIT \
            (ADC_INVERTING_AMP_CFG3_DIFFERENTIAL_FORMAT \
            << SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Pos)

    #define ADC_INVERTING_AMP_CFG3_AVG_SAMPLES_NUM_INIT \
            (ADC_INVERTING_AMP_CFG3_SAMPLES_AVERAGED \
            << SAR_SAMPLE_CTRL_AVG_CNT_Pos)

    /* Combination of Average Mode and Average Shift */
    #define ADC_INVERTING_AMP_CFG3_AVG_MODE_INIT \
            (ADC_INVERTING_AMP_CFG3_AVGERAGING_MODE \
            << SAR_SAMPLE_CTRL_AVG_SHIFT_Pos)

    #define ADC_INVERTING_AMP_CFG3_TRIGGER_OUT_INIT      (0u)
    #define ADC_INVERTING_AMP_CFG3_UAB_SCAN_MODE_INIT    (0u)

    #define ADC_INVERTING_AMP_CFG3_VREF_POWER_INIT  \
            (ADC_INVERTING_AMP_CFG3_VREF_PWR \
            << SAR_CTRL_PWR_CTRL_VREF_Pos)

    #define ADC_INVERTING_AMP_CFG3_COMP_PWR_INIT  \
            (ADC_INVERTING_AMP_CFG3_COMP_PWR \
            << SAR_CTRL_COMP_PWR_Pos)

    #define ADC_INVERTING_AMP_CFG3_COMP_DLY_INIT  \
            (ADC_INVERTING_AMP_CFG3_COMP_DLY \
            << SAR_CTRL_COMP_DLY_Pos)

    #define ADC_INVERTING_AMP_CFG3_CTRL_INIT  \
            (ADC_INVERTING_AMP_CFG3_VREF_POWER_INIT \
            | ADC_INVERTING_AMP_CFG3_VREF_SEL_MASK \
            | ADC_INVERTING_AMP_CFG3_SE_NEG_INPUT_INIT \
            | ADC_INVERTING_AMP_CFG3_HW_CTRL_NEGVREF_INIT \
            | ADC_INVERTING_AMP_CFG3_COMP_DLY_INIT \
            | SAR_CTRL_REFBUF_EN_Msk \
            | ADC_INVERTING_AMP_CFG3_COMP_PWR_INIT \
            | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
            | ADC_INVERTING_AMP_CFG3_SWITCH_CONF_INIT )


    #define ADC_INVERTING_AMP_CFG3_SAMPLE_CTRL_INIT \
            (ADC_INVERTING_AMP_CFG3_SE_RESULT_FORMAT_INIT \
            | ADC_INVERTING_AMP_CFG3_DIFF_RESULT_FORMAT_INIT \
            | ADC_INVERTING_AMP_CFG3_AVG_SAMPLES_NUM_INIT \
            | ADC_INVERTING_AMP_CFG3_AVG_MODE_INIT \
            | ADC_INVERTING_AMP_CFG3_DSI_TRIGGER_LEVEL_INIT \
            | ADC_INVERTING_AMP_CFG3_DSI_TRIGGER_EN_INIT \
            | ADC_INVERTING_AMP_CFG3_UAB_SCAN_MODE_INIT \
            | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
            | ADC_INVERTING_AMP_CFG3_TRIGGER_OUT_INIT \
            | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
    )

    #define ADC_INVERTING_AMP_CFG3_RANGE_THRES_INIT \
            (ADC_INVERTING_AMP_CFG3_LOW_LIMIT \
            | (uint32)((uint32)ADC_INVERTING_AMP_CFG3_HIGH_LIMIT \
            << SAR_RANGE_THRES_RANGE_HIGH_Pos))

    #define ADC_INVERTING_AMP_CFG3_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)ADC_INVERTING_AMP_CFG3_RANGE_COND

    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
    */
    #define ADC_INVERTING_AMP_CFG3_MISC_CONFIG_INIT \
            (ADC_INVERTING_AMP_CFG3_FREERUNNING )

#endif /* ADC_INVERTING_AMP_TOTAL_CONFIGS > 3 */

/* ************************************************************************** */
/* End configuration 3 calculated defines                                     */
/* ************************************************************************** */

/******************************************************************************
* Function Name: ADC_INVERTING_AMP_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_Enable(void)
{
    Cy_SAR_Enable(ADC_INVERTING_AMP_SAR__HW);
}

