vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/Generated_Source/PSoC6/ADC_INVERTING_AMP.h
/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the ADC_INVERTING_AMP_Stop() API to halt conversions. Instead use the
* ADC_INVERTING_AMP_StopConvert() API. If you use the ADC_INVERTING_AMP_Stop() API
* to halt conversions then later use the ADC_INVERTING_AMP_Start() and
* ADC_INVERTING_AMP_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The ADC_INVERTING_AMP_StopConvert() API will enable
* the ADC_INVERTING_AMP to complete the current scan of channels. After the
* channel scan is complete, the ADC_INVERTING_AMP will stop all conversions, which
* can be detected by the use of an ISR or the ADC_INVERTING_AMP_IsEndConversion()
* function.
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_Stop(void)
{
    Cy_SAR_Disable(ADC_INVERTING_AMP_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_StopConvert
****************************************************************************//**
*
* \brief Forces the ADC_INVERTING_AMP to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_StopConvert(void)
{
    Cy_SAR_StopConvert(ADC_INVERTING_AMP_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The ADC_INVERTING_AMP channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int16_t ADC_INVERTING_AMP_GetResult16(uint32_t chan)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_currentConfig].numChannels);

    return Cy_SAR_GetResult16(ADC_INVERTING_AMP_SAR__HW, chan);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The ADC_INVERTING_AMP channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t ADC_INVERTING_AMP_GetResult32(uint32_t chan)
{
    int32_t finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_currentConfig].numChannels);

    finalResult = Cy_SAR_GetResult32(ADC_INVERTING_AMP_SAR__HW, chan);

    return finalResult;
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_SetLowLimit
****************************************************************************//**
*
* \brief Sets the low limit parameter for a limit condition.
*
* \param lowLimit The low limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_SetLowLimit(uint32_t lowLimit)
{
    Cy_SAR_SetLowLimit(ADC_INVERTING_AMP_SAR__HW, lowLimit);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_SetHighLimit
****************************************************************************//**
*
* \brief Sets the high limit parameter for a limit condition.
*
* \param highLimit The high limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_SetHighLimit(uint32_t highLimit)
{
    Cy_SAR_SetHighLimit(ADC_INVERTING_AMP_SAR__HW, highLimit);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_SetLimitMask
****************************************************************************//**
*
* \brief Sets the channel limit condition mask.
*
*
* \param limitMask
* Sets which channels can cause a limit condition interrupt.
* Bit N of the mask enables the limit condition interrupt for channel N.
* The limitMask cannot be larger than the number of channels.
* If a channel is not enabled, it cannot cause any interrupts.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_SetLimitMask(uint32_t limitMask)
{
    Cy_SAR_SetRangeInterruptMask(ADC_INVERTING_AMP_SAR__HW, limitMask);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_SetSatMask
****************************************************************************//**
*
* \brief Sets the channel saturation event mask.
*
* \param satMask
* Sets which channels can cause a saturation event interrupt.
* Bit N of the mask enables the saturation event interrupt for channel N.
* The satMask cannot be larger than the number of channels.
* If a channel is not enabled, it cannot cause any interrupts.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_INVERTING_AMP_SetSatMask(uint32_t satMask)
{
    Cy_SAR_SetSatInterruptMask(ADC_INVERTING_AMP_SAR__HW, satMask);
}

