vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/Generated_Source/PSoC6/ADC_INVERTING_AMP.h
/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_SetOffset
****************************************************************************//**
*
* \brief Sets the ADC offset that is used by the functions ADC_INVERTING_AMP_CountsTo_uVolts,
* ADC_INVERTING_AMP_CountsTo_mVolts, and ADC_INVERTING_AMP_CountsTo_Volts.
*
* Offset is applied to counts before unit scaling and gain.  All CountsTo_[mV, uV, V]olts()
* functions use the following equation:
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* See CountsTo_Volts() for more about this formula.
*
* To set channel 0's offset based on known V_offset_mV, use:
*     ADC_INVERTING_AMP_SetOffset(0uL, -1 * V_offset_mV * (1uL << (Resolution - 1)) / V_ref_mV);
*
* \param chan ADC_INVERTING_AMP channel number.
*
* \param offset This value is a measured value when the inputs are shorted or
* connected to the same input voltage.
*
* \return cy_en_sar_status_t
* - CY_SAR_BAD_PARAM: channel number is equal to or greater than CY_SAR_MAX_NUM_CHANNELS
* - CY_SAR_SUCCESS: offset was set successfully
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE cy_en_sar_status_t ADC_INVERTING_AMP_SetOffset(uint32_t chan, int16_t offset)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_currentConfig].numChannels);

    return Cy_SAR_SetOffset(chan, offset);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_SetGain
****************************************************************************//**
*
* \brief Sets the ADC_INVERTING_AMP gain in counts per 10 volt for the voltage
* conversion functions. This value is set by default by the reference and
* input range settings. Gain is applied after offset and unit scaling.  All
* CountsTo_[mV, uV, V]olts() functions use the following equation:
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* See CountsTo_Volts() for more about this formula.
*
* To set channel 0's gain based on known V_ref_mV, use:
*     ADC_INVERTING_AMP_SetGain(0uL, 10000 * (1uL << (Resolution - 1)) / V_ref_mV);
*
* \param chan ADC_INVERTING_AMP channel number.
*
* \param adcGain ADC_INVERTING_AMP gain in counts per 10 volt.
*
* \return cy_en_sar_status_t
* - CY_SAR_BAD_PARAM: channel number is equal to or greater than CY_SAR_MAX_NUM_CHANNELS
* - CY_SAR_SUCCESS: gain was set successfully
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE cy_en_sar_status_t ADC_INVERTING_AMP_SetGain(uint32_t chan, int32_t adcGain)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_currentConfig].numChannels);

    return Cy_SAR_SetGain(chan, adcGain);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_CountsTo_Volts
****************************************************************************//**
*
* \brief Converts the ADC output to Volts as a float32. For example, if the ADC
* measured 0.534 volts, the return value would be 0.534.
* The calculation of voltage depends on the contents of Cy_SAR_offset[],
* Cy_SAR_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = Cy_SAR_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = Cy_SAR_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_INVERTING_AMP channel number.
*
* \param adcCounts Result from the ADC_INVERTING_AMP conversion.
*
* \return Result in Volts.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE float32_t ADC_INVERTING_AMP_CountsTo_Volts(uint32_t chan, int16_t adcCounts)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_currentConfig].numChannels);

    return Cy_SAR_CountsTo_Volts(ADC_INVERTING_AMP_SAR__HW, chan, adcCounts);
}

/*******************************************************************************
* Function Name: ADC_INVERTING_AMP_CountsTo_mVolts
****************************************************************************//**
*
* \brief Converts the ADC output to millivolts as an int16. For example, if the ADC
* measured 0.534 volts, the return value would be 534.
* The calculation of voltage depends on the contents of Cy_SAR_offset[],
* Cy_SAR_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = Cy_SAR_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = Cy_SAR_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_INVERTING_AMP channel number.
*
* \param adcCounts Result from the ADC_INVERTING_AMP conversion.
*
* \return Result in mV.
*
* \sideeffect None.
*
*******************************************************************************/
__STATIC_INLINE int16_t ADC_INVERTING_AMP_CountsTo_mVolts(uint32_t chan, int16_t adcCounts)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_INVERTING_AMP_allConfigs[ADC_INVERTING_AMP_currentConfig].numChannels);

    return Cy_SAR_CountsTo_mVolts(ADC_INVERTING_AMP_SAR__HW, chan, adcCounts);
}

